[

    {
        "title": "Verbs that do not change",
        "category": "Verbos Irregulares",
        "english_text": "CUT: Cut - Cut - Cut. Present: I cut the cables carefully during the installation process. Past: She cut the paper into precise shapes for the project. Past participle: They have cut unnecessary expenses to balance the budget.\nHIT: Hit - Hit - Hit. Present: He hit the nail perfectly on his first try. Past: The system hit a performance issue during testing. Past participle: They have hit their targets for the quarterly sales goals.\nSET: Set - Set - Set. Present: I set reminders to stay organized at work. Past: She set the table before the meeting started. Past participle: The technician has set up the network successfully.\nPUT: Put - Put - Put. Present: I put my laptop on the desk before starting. Past: He put the files in the correct folder yesterday. Past participle: They have put great effort into completing the project.\nCOST: Cost - Cost - Cost. Present: This upgrade cost a significant amount of money. Past: The error cost the team valuable time. Past participle: The changes have cost the company a lot of resources.\nSHUT: Shut - Shut - Shut. Present: I shut down the system after finishing the task. Past: She shut the door quietly to avoid distractions. Past participle: They have shut off the power to the old servers.\nLET: Let - Let - Let. Present: I let the new team member take the lead on this project. Past: She let him borrow her laptop for the presentation. Past participle: They have let the interns participate in major projects.\nSPREAD: Spread - Spread - Spread. Present: I spread the word about the upcoming workshop. Past: He spread the documents on the table for the meeting. Past participle: The team has spread awareness about the new software features.\nSPLIT: Split - Split - Split. Present: I split the tasks equally among the team members. Past: She split the document into sections for easier editing. Past participle: The company has split the department into two specialized units.\nQUIT: Quit - Quit - Quit. Present: I quit using outdated software to improve productivity. Past: He quit his job last year to start his own business. Past participle: They have quit relying on manual processes for data analysis.",
        "spanish_translation": "CORTAR: Cortar - Cortó - Cortado. Presente: Corto los cables cuidadosamente durante el proceso de instalación. Pasado: Ella cortó el papel en formas precisas para el proyecto. Participio pasado: Han cortado gastos innecesarios para equilibrar el presupuesto.\nGOLPEAR: Golpear - Golpeó - Golpeado. Presente: Él golpea el clavo perfectamente en su primer intento. Pasado: El sistema golpeó un problema de rendimiento durante las pruebas. Participio pasado: Han alcanzado sus objetivos para las metas trimestrales de ventas.\nFIJAR: Fijar - Fijó - Fijado. Presente: Fijo recordatorios para mantenerme organizado en el trabajo. Pasado: Ella fijó la mesa antes de que comenzara la reunión. Participio pasado: El técnico ha configurado la red con éxito.\nPONER: Poner - Puso - Puesto. Presente: Pongo mi laptop en el escritorio antes de empezar. Pasado: Él puso los archivos en la carpeta correcta ayer. Participio pasado: Han puesto un gran esfuerzo en completar el proyecto.\nCOSTAR: Costar - Costó - Costado. Presente: Esta actualización cuesta una cantidad significativa de dinero. Pasado: El error costó al equipo un tiempo valioso. Participio pasado: Los cambios han costado muchos recursos a la empresa.\nCERRAR: Cerrar - Cerró - Cerrado. Presente: Cierro el sistema después de terminar la tarea. Pasado: Ella cerró la puerta en silencio para evitar distracciones. Participio pasado: Han cerrado la energía a los servidores antiguos.\nPERMITIR: Permitir - Permitió - Permitido. Presente: Permito que el nuevo miembro del equipo lidere este proyecto. Pasado: Ella le permitió usar su laptop para la presentación. Participio pasado: Han permitido que los pasantes participen en proyectos importantes.\nPROPAGAR: Propagar - Propagó - Propagado. Presente: Propago la información sobre el próximo taller. Pasado: Él propagó los documentos en la mesa para la reunión. Participio pasado: El equipo ha propagado la conciencia sobre las nuevas características del software.\nDIVIDIR: Dividir - Dividió - Dividido. Presente: Divido las tareas equitativamente entre los miembros del equipo. Pasado: Ella dividió el documento en secciones para una edición más sencilla. Participio pasado: La empresa ha dividido el departamento en dos unidades especializadas.\nRENUNCIAR: Renunciar - Renunció - Renunciado. Presente: Renuncio a usar software obsoleto para mejorar la productividad. Pasado: Él renunció a su trabajo el año pasado para iniciar su propio negocio. Participio pasado: Han renunciado a depender de procesos manuales para el análisis de datos."
      }
      
]